<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Socialite Providers
    |--------------------------------------------------------------------------
    |
    | 這邊定義要使用哪些 Socialite Providers
    |
    */

    'providers' => [
        'github',
        'facebook',
        'line',
    ],

    /*
    |--------------------------------------------------------------------------
    | Allowed Domains
    |--------------------------------------------------------------------------
    |
    | 這邊定義允許哪些域名使用 SocialEntry
    |
    */

    'allowed_domains' => [
        ...explode(',', 'localhost,localhost:8000'),
        env('APP_URL'),
    ],
];
